[
  { "stockName": "Google", "text": "Stock of Google is rising in a great way. Good news for investors." },
  { "stockName": "Apple", "text": "Apple's stock shows strong upward momentum. A solid investment opportunity." },
  { "stockName": "Amazon", "text": "Amazon shares are performing exceptionally well. Great news for shareholders." },
  { "stockName": "Microsoft", "text": "Microsoft's stock is hitting new highs. Investors should be pleased." },
  { "stockName": "Tesla", "text": "Tesla's stock is on a positive trajectory. Investors are in for a rewarding time." },
  { "stockName": "Facebook", "text": "Facebook's stock is showing impressive gains. A bright outlook for investors." },
  { "stockName": "Nvidia", "text": "Nvidia's shares are soaring. Excellent news for those holding the stock." },
  { "stockName": "Netflix", "text": "Netflix's stock is experiencing a significant uptrend. A favorable sign for investors." },
  { "stockName": "Intel", "text": "Intel's stock is making notable progress. A positive development for shareholders." },
  { "stockName": "Adobe", "text": "Adobe's stock is performing well with strong gains. A good sign for the market." },
  { "stockName": "IBM", "text": "IBM's stock is plummeting. Investors should be cautious." },
  { "stockName": "Oracle", "text": "Oracle's stock is struggling. A concerning trend for shareholders." },
  { "stockName": "Salesforce", "text": "Salesforce shares are experiencing a significant downturn. Investors might face challenges." },
  { "stockName": "Cisco", "text": "Cisco's stock is falling sharply. A worrying sign for investors." },
  { "stockName": "Adobe", "text": "Adobe's stock is dropping rapidly. Investors should be wary." },
  { "stockName": "SAP", "text": "SAP's stock is in decline. Not a promising scenario for shareholders." },
  { "stockName": "Qualcomm", "text": "Qualcomm's shares are experiencing a downturn. Investors might face losses." },
  { "stockName": "Zoom", "text": "Zoom's stock is falling. A negative indicator for the market." },
  { "stockName": "Palantir", "text": "Palantir's stock is struggling with poor performance. Investors should take note." },
  { "stockName": "Square", "text": "Square's stock is declining sharply. A troubling sign for shareholders." }

]
